# Создайте новую Базу данных.
# В ней создайте таблицу с четырьмя полями(имеющие название
# title,author,	price, amount), два текстовых,
# и два – целых чисел. Values(туда пишем название книги,
# автора, цен книги и количество) - должно быть состоять из 6 строк
# Все значения задаются динамически
# Указать в запросе столбцы: Автор, Название, Количество;
# Указать новую цену (столбец sale);
# Посчитать затраты по акции: снижение цены + кофе (столбец Затраты);
# Посчитать выручку по акции (столбец Выручка);
# Округлить цены до 2х знаков после запятой;
# Отсортировать авторов и названия книг в алфавитном порядке.