# Создайте новую Базу данных.
# В ней создайте таблицу с четырьмя полями(имеющие название
# title,author,	price, amount), два текстовых,
# и два – целых чисел. Values(туда пишем название книги,
# автора, цен книги и количество) - должно быть состоять из 6 строк
# Все значения задаются динамически
# Вывести  автора и название  книг, количество которых принадлежит интервалу
# от 2 до 14 (включая границы). Информацию  отсортировать сначала по авторам
# (в обратном алфавитном порядке), а затем по названиям книг (по алфавиту).